#Программа которая преобразовывает введенный текст в азбуку морза.
Line = input('Введите текс: ')
Line = Line.upper()
Result = ''
MorseCode = {'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.', 'F': '..-.', 'G': '--.', 'H': '....', 'I': '..',
             'J': '.---', 'K': '-.-', 'L': '.-..', 'M': '--', 'N': '-.', 'O': '---', 'P': '.--.', 'Q': '--.-', 'R': '.-.',
             'S': '...', 'T': '-', 'U': '..-', 'V': '...-', 'W': '.--', 'X': '-..-', 'Y': '-.--', 'Z': '--..', '0': '-----',
             '1': '.----', '2': '..---', '3': '...--', '4': '....-', '5': '.....', '6': '-....', '7': '--...', '8': '---..',
             '9': '----.'}
for i in Line:
    if i in MorseCode:
        Result += MorseCode[i] + ' '
    else:
        Result += ' '
print('Ваш текст преобразованный в азбуку морза:', Result)
